## Plan Result (prod_vm)




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 26 to add, 4 to change, 26 to destroy.</code></pre>

* Update
  * azurerm_key_vault_secret.username_secret[&#34;crime-portal-frontend-vm01-prod&#34;]
  * azurerm_key_vault_secret.username_secret[&#34;crime-portal-frontend-vm02-prod&#34;]
  * azurerm_key_vault_secret.username_secret[&#34;crime-portal-ldap-vm01-prod&#34;]
  * azurerm_key_vault_secret.username_secret[&#34;crime-portal-ldap-vm02-prod&#34;]
* Replace
  * azurerm_backup_protected_vm.vm[&#34;crime-portal-frontend-vm01-prod&#34;]
  * azurerm_backup_protected_vm.vm[&#34;crime-portal-frontend-vm02-prod&#34;]
  * azurerm_backup_protected_vm.vm[&#34;crime-portal-ldap-vm01-prod&#34;]
  * azurerm_backup_protected_vm.vm[&#34;crime-portal-ldap-vm02-prod&#34;]
  * azurerm_virtual_machine_extension.AADSSHLoginForLinux[&#34;crime-portal-frontend-vm01-prod&#34;]
  * azurerm_virtual_machine_extension.AADSSHLoginForLinux[&#34;crime-portal-frontend-vm02-prod&#34;]
  * azurerm_virtual_machine_extension.AADSSHLoginForLinux[&#34;crime-portal-ldap-vm01-prod&#34;]
  * azurerm_virtual_machine_extension.AADSSHLoginForLinux[&#34;crime-portal-ldap-vm02-prod&#34;]
  * azurerm_virtual_machine_extension.install_docker[&#34;crime-portal-frontend-vm01-prod&#34;]
  * azurerm_virtual_machine_extension.install_docker[&#34;crime-portal-frontend-vm02-prod&#34;]
  * module.virtual-machines[&#34;crime-portal-frontend-vm01-prod&#34;].azurerm_linux_virtual_machine.linvm[0]
  * module.virtual-machines[&#34;crime-portal-frontend-vm02-prod&#34;].azurerm_linux_virtual_machine.linvm[0]
  * module.virtual-machines[&#34;crime-portal-ldap-vm01-prod&#34;].azurerm_linux_virtual_machine.linvm[0]
  * module.virtual-machines[&#34;crime-portal-ldap-vm02-prod&#34;].azurerm_linux_virtual_machine.linvm[0]
  * module.virtual-machines[&#34;crime-portal-frontend-vm01-prod&#34;].module.vm-bootstrap[0].azurerm_virtual_machine_extension.azure_monitor[0]
  * module.virtual-machines[&#34;crime-portal-frontend-vm01-prod&#34;].module.vm-bootstrap[0].azurerm_virtual_machine_extension.custom_script[0]
  * module.virtual-machines[&#34;crime-portal-frontend-vm01-prod&#34;].module.vm-bootstrap[0].azurerm_virtual_machine_extension.dynatrace_oneagent[0]
  * module.virtual-machines[&#34;crime-portal-frontend-vm02-prod&#34;].module.vm-bootstrap[0].azurerm_virtual_machine_extension.azure_monitor[0]
  * module.virtual-machines[&#34;crime-portal-frontend-vm02-prod&#34;].module.vm-bootstrap[0].azurerm_virtual_machine_extension.custom_script[0]
  * module.virtual-machines[&#34;crime-portal-frontend-vm02-prod&#34;].module.vm-bootstrap[0].azurerm_virtual_machine_extension.dynatrace_oneagent[0]
  * module.virtual-machines[&#34;crime-portal-ldap-vm01-prod&#34;].module.vm-bootstrap[0].azurerm_virtual_machine_extension.azure_monitor[0]
  * module.virtual-machines[&#34;crime-portal-ldap-vm01-prod&#34;].module.vm-bootstrap[0].azurerm_virtual_machine_extension.custom_script[0]
  * module.virtual-machines[&#34;crime-portal-ldap-vm01-prod&#34;].module.vm-bootstrap[0].azurerm_virtual_machine_extension.dynatrace_oneagent[0]
  * module.virtual-machines[&#34;crime-portal-ldap-vm02-prod&#34;].module.vm-bootstrap[0].azurerm_virtual_machine_extension.azure_monitor[0]
  * module.virtual-machines[&#34;crime-portal-ldap-vm02-prod&#34;].module.vm-bootstrap[0].azurerm_virtual_machine_extension.custom_script[0]
  * module.virtual-machines[&#34;crime-portal-ldap-vm02-prod&#34;].module.vm-bootstrap[0].azurerm_virtual_machine_extension.dynatrace_oneagent[0]




<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_backup_protected_vm.vm["crime-portal-frontend-vm01-prod"] must be replaced
-/+ resource "azurerm_backup_protected_vm" "vm" {
      ~ id                  = "/subscriptions/17390ec1-5a5e-4a20-afb3-38d8d726ae45/resourceGroups/crime-portal-rg-prod/providers/Microsoft.RecoveryServices/vaults/crime-portal-rsv-prod/backupFabrics/Azure/protectionContainers/iaasvmcontainer;iaasvmcontainerv2;crime-portal-rg-prod;crime-portal-frontend-vm01-prod/protectedItems/VM;iaasvmcontainerv2;crime-portal-rg-prod;crime-portal-frontend-vm01-prod" -> (known after apply)
      ~ protection_state    = "Protected" -> (known after apply)
      ~ source_vm_id        = "/subscriptions/17390ec1-5a5e-4a20-afb3-38d8d726ae45/resourceGroups/crime-portal-rg-prod/providers/Microsoft.Compute/virtualMachines/crime-portal-frontend-vm01-prod" # forces replacement -> (known after apply) # forces replacement
        # (3 unchanged attributes hidden)
    }

  # azurerm_backup_protected_vm.vm["crime-portal-frontend-vm02-prod"] must be replaced
-/+ resource "azurerm_backup_protected_vm" "vm" {
      ~ id                  = "/subscriptions/17390ec1-5a5e-4a20-afb3-38d8d726ae45/resourceGroups/crime-portal-rg-prod/providers/Microsoft.RecoveryServices/vaults/crime-portal-rsv-prod/backupFabrics/Azure/protectionContainers/iaasvmcontainer;iaasvmcontainerv2;crime-portal-rg-prod;crime-portal-frontend-vm02-prod/protectedItems/VM;iaasvmcontainerv2;crime-portal-rg-prod;crime-portal-frontend-vm02-prod" -> (known after apply)
      ~ protection_state    = "Protected" -> (known after apply)
      ~ source_vm_id        = "/subscriptions/17390ec1-5a5e-4a20-afb3-38d8d726ae45/resourceGroups/crime-portal-rg-prod/providers/Microsoft.Compute/virtualMachines/crime-portal-frontend-vm02-prod" # forces replacement -> (known after apply) # forces replacement
        # (3 unchanged attributes hidden)
    }

  # azurerm_backup_protected_vm.vm["crime-portal-ldap-vm01-prod"] must be replaced
-/+ resource "azurerm_backup_protected_vm" "vm" {
      ~ id                  = "/subscriptions/17390ec1-5a5e-4a20-afb3-38d8d726ae45/resourceGroups/crime-portal-rg-prod/providers/Microsoft.RecoveryServices/vaults/crime-portal-rsv-prod/backupFabrics/Azure/protectionContainers/iaasvmcontainer;iaasvmcontainerv2;crime-portal-rg-prod;crime-portal-ldap-vm01-prod/protectedItems/VM;iaasvmcontainerv2;crime-portal-rg-prod;crime-portal-ldap-vm01-prod" -> (known after apply)
      ~ protection_state    = "Protected" -> (known after apply)
      ~ source_vm_id        = "/subscriptions/17390ec1-5a5e-4a20-afb3-38d8d726ae45/resourceGroups/crime-portal-rg-prod/providers/Microsoft.Compute/virtualMachines/crime-portal-ldap-vm01-prod" # forces replacement -> (known after apply) # forces replacement
        # (3 unchanged attributes hidden)
    }

  # azurerm_backup_protected_vm.vm["crime-portal-ldap-vm02-prod"] must be replaced
-/+ resource "azurerm_backup_protected_vm" "vm" {
      ~ id                  = "/subscriptions/17390ec1-5a5e-4a20-afb3-38d8d726ae45/resourceGroups/crime-portal-rg-prod/providers/Microsoft.RecoveryServices/vaults/crime-portal-rsv-prod/backupFabrics/Azure/protectionContainers/iaasvmcontainer;iaasvmcontainerv2;crime-portal-rg-prod;crime-portal-ldap-vm02-prod/protectedItems/VM;iaasvmcontainerv2;crime-portal-rg-prod;crime-portal-ldap-vm02-prod" -> (known after apply)
      ~ protection_state    = "Protected" -> (known after apply)
      ~ source_vm_id        = "/subscriptions/17390ec1-5a5e-4a20-afb3-38d8d726ae45/resourceGroups/crime-portal-rg-prod/providers/Microsoft.Compute/virtualMachines/crime-portal-ldap-vm02-prod" # forces replacement -> (known after apply) # forces replacement
        # (3 unchanged attributes hidden)
    }

  # azurerm_key_vault_secret.username_secret["crime-portal-frontend-vm01-prod"] will be updated in-place
  ~ resource "azurerm_key_vault_secret" "username_secret" {
        id                      = "https://crime-portal-kv-prod.vault.azure.net/secrets/crime-portal-frontend-vm01-prod-vm-username-prod/6e406a6b8b8948ba9013f81c16110fa0"
        name                    = "crime-portal-frontend-vm01-prod-vm-username-prod"
        tags                    = {}
      ~ value                   = (sensitive value)
        # (5 unchanged attributes hidden)
    }

  # azurerm_key_vault_secret.username_secret["crime-portal-frontend-vm02-prod"] will be updated in-place
  ~ resource "azurerm_key_vault_secret" "username_secret" {
        id                      = "https://crime-portal-kv-prod.vault.azure.net/secrets/crime-portal-frontend-vm02-prod-vm-username-prod/8f12543169d44c0c84a3f00cd57fa4d2"
        name                    = "crime-portal-frontend-vm02-prod-vm-username-prod"
        tags                    = {}
      ~ value                   = (sensitive value)
        # (5 unchanged attributes hidden)
    }

  # azurerm_key_vault_secret.username_secret["crime-portal-ldap-vm01-prod"] will be updated in-place
  ~ resource "azurerm_key_vault_secret" "username_secret" {
        id                      = "https://crime-portal-kv-prod.vault.azure.net/secrets/crime-portal-ldap-vm01-prod-vm-username-prod/ef34d30c0309446ca0d964c2a472b9ca"
        name                    = "crime-portal-ldap-vm01-prod-vm-username-prod"
        tags                    = {}
      ~ value                   = (sensitive value)
        # (5 unchanged attributes hidden)
    }

  # azurerm_key_vault_secret.username_secret["crime-portal-ldap-vm02-prod"] will be updated in-place
  ~ resource "azurerm_key_vault_secret" "username_secret" {
        id                      = "https://crime-portal-kv-prod.vault.azure.net/secrets/crime-portal-ldap-vm02-prod-vm-username-prod/d74fd30bca32456bbc74bc7736b04409"
        name                    = "crime-portal-ldap-vm02-prod-vm-username-prod"
        tags                    = {}
      ~ value                   = (sensitive value)
        # (5 unchanged attributes hidden)
    }

  # azurerm_virtual_machine_extension.AADSSHLoginForLinux["crime-portal-frontend-vm01-prod"] must be replaced
-/+ resource "azurerm_virtual_machine_extension" "AADSSHLoginForLinux" {
      - automatic_upgrade_enabled   = false -> null
      ~ id                          = "/subscriptions/17390ec1-5a5e-4a20-afb3-38d8d726ae45/resourceGroups/crime-portal-rg-prod/providers/Microsoft.Compute/virtualMachines/crime-portal-frontend-vm01-prod/extensions/AADSSHLoginForLinux" -> (known after apply)
        name                        = "AADSSHLoginForLinux"
        tags                        = {
            "application"  = "crime-portal"
            "builtFrom"    = "hmcts/crime-portal-infra"
            "businessArea" = "cross-cutting"
            "criticality"  = "High"
            "environment"  = "production"
        }
      ~ virtual_machine_id          = "/subscriptions/17390ec1-5a5e-4a20-afb3-38d8d726ae45/resourceGroups/crime-portal-rg-prod/providers/Microsoft.Compute/virtualMachines/crime-portal-frontend-vm01-prod" # forces replacement -> (known after apply) # forces replacement
        # (5 unchanged attributes hidden)
    }

  # azurerm_virtual_machine_extension.AADSSHLoginForLinux["crime-portal-frontend-vm02-prod"] must be replaced
-/+ resource "azurerm_virtual_machine_extension" "AADSSHLoginForLinux" {
      - automatic_upgrade_enabled   = false -> null
      ~ id                          = "/subscriptions/17390ec1-5a5e-4a20-afb3-38d8d726ae45/resourceGroups/crime-portal-rg-prod/providers/Microsoft.Compute/virtualMachines/crime-portal-frontend-vm02-prod/extensions/AADSSHLoginForLinux" -> (known after apply)
        name                        = "AADSSHLoginForLinux"
        tags                        = {
            "application"  = "crime-portal"
            "builtFrom"    = "hmcts/crime-portal-infra"
            "businessArea" = "cross-cutting"
            "criticality"  = "High"
            "environment"  = "production"
        }
      ~ virtual_machine_id          = "/subscriptions/17390ec1-5a5e-4a20-afb3-38d8d726ae45/resourceGroups/crime-portal-rg-prod/providers/Microsoft.Compute/virtualMachines/crime-portal-frontend-vm02-prod" # forces replacement -> (known after apply) # forces replacement
        # (5 unchanged attributes hidden)
    }

  # azurerm_virtual_machine_extension.AADSSHLoginForLinux["crime-portal-ldap-vm01-prod"] must be replaced
-/+ resource "azurerm_virtual_machine_extension" "AADSSHLoginForLinux" {
      - automatic_upgrade_enabled   = false -> null
      ~ id                          = "/subscriptions/17390ec1-5a5e-4a20-afb3-38d8d726ae45/resourceGroups/crime-portal-rg-prod/providers/Microsoft.Compute/virtualMachines/crime-portal-ldap-vm01-prod/extensions/AADSSHLoginForLinux" -> (known after apply)
        name                        = "AADSSHLoginForLinux"
        tags                        = {
            "application"  = "crime-portal"
            "builtFrom"    = "hmcts/crime-portal-infra"
            "businessArea" = "cross-cutting"
            "criticality"  = "High"
            "environment"  = "production"
        }
      ~ virtual_machine_id          = "/subscriptions/17390ec1-5a5e-4a20-afb3-38d8d726ae45/resourceGroups/crime-portal-rg-prod/providers/Microsoft.Compute/virtualMachines/crime-portal-ldap-vm01-prod" # forces replacement -> (known after apply) # forces replacement
        # (5 unchanged attributes hidden)
    }

  # azurerm_virtual_machine_extension.AADSSHLoginForLinux["crime-portal-ldap-vm02-prod"] must be replaced
-/+ resource "azurerm_virtual_machine_extension" "AADSSHLoginForLinux" {
      - automatic_upgrade_enabled   = false -> null
      ~ id                          = "/subscriptions/17390ec1-5a5e-4a20-afb3-38d8d726ae45/resourceGroups/crime-portal-rg-prod/providers/Microsoft.Compute/virtualMachines/crime-portal-ldap-vm02-prod/extensions/AADSSHLoginForLinux" -> (known after apply)
        name                        = "AADSSHLoginForLinux"
        tags                        = {
            "application"  = "crime-portal"
            "builtFrom"    = "hmcts/crime-portal-infra"
            "businessArea" = "cross-cutting"
            "criticality"  = "High"
            "environment"  = "production"
        }
      ~ virtual_machine_id          = "/subscriptions/17390ec1-5a5e-4a20-afb3-38d8d726ae45/resourceGroups/crime-portal-rg-prod/providers/Microsoft.Compute/virtualMachines/crime-portal-ldap-vm02-prod" # forces replacement -> (known after apply) # forces replacement
        # (5 unchanged attributes hidden)
    }

  # azurerm_virtual_machine_extension.install_docker["crime-portal-frontend-vm01-prod"] must be replaced
-/+ resource "azurerm_virtual_machine_extension" "install_docker" {
      - automatic_upgrade_enabled   = false -> null
      ~ id                          = "/subscriptions/17390ec1-5a5e-4a20-afb3-38d8d726ae45/resourceGroups/crime-portal-rg-prod/providers/Microsoft.Compute/virtualMachines/crime-portal-frontend-vm01-prod/extensions/InstallDocker" -> (known after apply)
        name                        = "InstallDocker"
        tags                        = {
            "application"  = "crime-portal"
            "builtFrom"    = "hmcts/crime-portal-infra"
            "businessArea" = "cross-cutting"
            "criticality"  = "High"
            "environment"  = "production"
        }
      ~ virtual_machine_id          = "/subscriptions/17390ec1-5a5e-4a20-afb3-38d8d726ae45/resourceGroups/crime-portal-rg-prod/providers/Microsoft.Compute/virtualMachines/crime-portal-frontend-vm01-prod" # forces replacement -> (known after apply) # forces replacement
        # (6 unchanged attributes hidden)
    }

  # azurerm_virtual_machine_extension.install_docker["crime-portal-frontend-vm02-prod"] must be replaced
-/+ resource "azurerm_virtual_machine_extension" "install_docker" {
      - automatic_upgrade_enabled   = false -> null
      ~ id                          = "/subscriptions/17390ec1-5a5e-4a20-afb3-38d8d726ae45/resourceGroups/crime-portal-rg-prod/providers/Microsoft.Compute/virtualMachines/crime-portal-frontend-vm02-prod/extensions/InstallDocker" -> (known after apply)
        name                        = "InstallDocker"
        tags                        = {
            "application"  = "crime-portal"
            "builtFrom"    = "hmcts/crime-portal-infra"
            "businessArea" = "cross-cutting"
            "criticality"  = "High"
            "environment"  = "production"
        }
      ~ virtual_machine_id          = "/subscriptions/17390ec1-5a5e-4a20-afb3-38d8d726ae45/resourceGroups/crime-portal-rg-prod/providers/Microsoft.Compute/virtualMachines/crime-portal-frontend-vm02-prod" # forces replacement -> (known after apply) # forces replacement
        # (6 unchanged attributes hidden)
    }

  # module.virtual-machines["crime-portal-frontend-vm01-prod"].azurerm_linux_virtual_machine.linvm[0] must be replaced
-/+ resource "azurerm_linux_virtual_machine" "linvm" {
      ~ admin_username                                         = "JXHk" -> "crimeportal_JXHk" # forces replacement
      ~ computer_name                                          = "crime-portal-frontend-vm01-prod" -> (known after apply)
      - encryption_at_host_enabled                             = false -> null
      ~ id                                                     = "/subscriptions/17390ec1-5a5e-4a20-afb3-38d8d726ae45/resourceGroups/crime-portal-rg-prod/providers/Microsoft.Compute/virtualMachines/crime-portal-frontend-vm01-prod" -> (known after apply)
        name                                                   = "crime-portal-frontend-vm01-prod"
      ~ private_ip_address                                     = "10.24.246.20" -> (known after apply)
      ~ private_ip_addresses                                   = [
          - "10.24.246.20",
        ] -> (known after apply)
      + public_ip_address                                      = (known after apply)
      ~ public_ip_addresses                                    = [] -> (known after apply)
      - secure_boot_enabled                                    = false -> null
        tags                                                   = {
            "application"  = "crime-portal"
            "builtFrom"    = "hmcts/crime-portal-infra"
            "businessArea" = "cross-cutting"
            "criticality"  = "High"
            "environment"  = "production"
        }
      ~ virtual_machine_id                                     = "afa53334-0585-4c91-8fdc-e8169cfd44ff" -> (known after apply)
      - vtpm_enabled                                           = false -> null
        # (16 unchanged attributes hidden)

      ~ identity {
          - identity_ids = [] -> null
          ~ principal_id = "74db19c1-1c6a-4a5d-ae71-3dd81799694c" -> (known after apply)
          ~ tenant_id    = "531ff96d-0ae9-462a-8d2d-bec7c0b42082" -> (known after apply)
            # (1 unchanged attribute hidden)
        }

      ~ os_disk {
          ~ disk_size_gb              = 30 -> 128
          ~ name                      = "crime-portal-frontend-vm01-prod_OsDisk_1_652a20821ff24565b969ee4b23cdf3f6" -> (known after apply)
            # (3 unchanged attributes hidden)
        }

        # (2 unchanged blocks hidden)
    }

  # module.virtual-machines["crime-portal-frontend-vm02-prod"].azurerm_linux_virtual_machine.linvm[0] must be replaced
-/+ resource "azurerm_linux_virtual_machine" "linvm" {
      ~ admin_username                                         = "WYCs" -> "crimeportal_WYCs" # forces replacement
      ~ computer_name                                          = "crime-portal-frontend-vm02-prod" -> (known after apply)
      - encryption_at_host_enabled                             = false -> null
      ~ id                                                     = "/subscriptions/17390ec1-5a5e-4a20-afb3-38d8d726ae45/resourceGroups/crime-portal-rg-prod/providers/Microsoft.Compute/virtualMachines/crime-portal-frontend-vm02-prod" -> (known after apply)
        name                                                   = "crime-portal-frontend-vm02-prod"
      ~ private_ip_address                                     = "10.24.246.21" -> (known after apply)
      ~ private_ip_addresses                                   = [
          - "10.24.246.21",
        ] -> (known after apply)
      + public_ip_address                                      = (known after apply)
      ~ public_ip_addresses                                    = [] -> (known after apply)
      - secure_boot_enabled                                    = false -> null
        tags                                                   = {
            "application"  = "crime-portal"
            "builtFrom"    = "hmcts/crime-portal-infra"
            "businessArea" = "cross-cutting"
            "criticality"  = "High"
            "environment"  = "production"
        }
      ~ virtual_machine_id                                     = "7a4fb8d5-91ec-48ce-9eaa-0e8900933667" -> (known after apply)
      - vtpm_enabled                                           = false -> null
        # (16 unchanged attributes hidden)

      ~ identity {
          - identity_ids = [] -> null
          ~ principal_id = "418d0c66-b2ff-4e12-b644-a789d2a930de" -> (known after apply)
          ~ tenant_id    = "531ff96d-0ae9-462a-8d2d-bec7c0b42082" -> (known after apply)
            # (1 unchanged attribute hidden)
        }

      ~ os_disk {
          ~ disk_size_gb              = 30 -> 128
          ~ name                      = "crime-portal-frontend-vm02-prod_OsDisk_1_cca4730f4dfa43b48795108616037d8b" -> (known after apply)
            # (3 unchanged attributes hidden)
        }

        # (2 unchanged blocks hidden)
    }

  # module.virtual-machines["crime-portal-ldap-vm01-prod"].azurerm_linux_virtual_machine.linvm[0] must be replaced
-/+ resource "azurerm_linux_virtual_machine" "linvm" {
      ~ admin_username                                         = "8sqs" -> "crimeportal_8sqs" # forces replacement
      ~ computer_name                                          = "crime-portal-ldap-vm01-prod" -> (known after apply)
      - encryption_at_host_enabled                             = false -> null
      ~ id                                                     = "/subscriptions/17390ec1-5a5e-4a20-afb3-38d8d726ae45/resourceGroups/crime-portal-rg-prod/providers/Microsoft.Compute/virtualMachines/crime-portal-ldap-vm01-prod" -> (known after apply)
        name                                                   = "crime-portal-ldap-vm01-prod"
      ~ private_ip_address                                     = "10.24.246.38" -> (known after apply)
      ~ private_ip_addresses                                   = [
          - "10.24.246.38",
        ] -> (known after apply)
      + public_ip_address                                      = (known after apply)
      ~ public_ip_addresses                                    = [] -> (known after apply)
      - secure_boot_enabled                                    = false -> null
        tags                                                   = {
            "application"  = "crime-portal"
            "builtFrom"    = "hmcts/crime-portal-infra"
            "businessArea" = "cross-cutting"
            "criticality"  = "High"
            "environment"  = "production"
        }
      ~ virtual_machine_id                                     = "ca4e3b3b-4d8b-41d9-bd7e-7f26e7638244" -> (known after apply)
      - vtpm_enabled                                           = false -> null
        # (16 unchanged attributes hidden)

      ~ identity {
          - identity_ids = [] -> null
          ~ principal_id = "0325192e-2544-4230-bcf6-b8fb17db00ad" -> (known after apply)
          ~ tenant_id    = "531ff96d-0ae9-462a-8d2d-bec7c0b42082" -> (known after apply)
            # (1 unchanged attribute hidden)
        }

      ~ os_disk {
          ~ disk_size_gb              = 30 -> 128
          ~ name                      = "crime-portal-ldap-vm01-prod_OsDisk_1_642f9617fcf140b1b54287862bdef002" -> (known after apply)
            # (3 unchanged attributes hidden)
        }

        # (2 unchanged blocks hidden)
    }

  # module.virtual-machines["crime-portal-ldap-vm02-prod"].azurerm_linux_virtual_machine.linvm[0] must be replaced
-/+ resource "azurerm_linux_virtual_machine" "linvm" {
      ~ admin_username                                         = "hSWa" -> "crimeportal_hSWa" # forces replacement
      ~ computer_name                                          = "crime-portal-ldap-vm02-prod" -> (known after apply)
      - encryption_at_host_enabled                             = false -> null
      ~ id                                                     = "/subscriptions/17390ec1-5a5e-4a20-afb3-38d8d726ae45/resourceGroups/crime-portal-rg-prod/providers/Microsoft.Compute/virtualMachines/crime-portal-ldap-vm02-prod" -> (known after apply)
        name                                                   = "crime-portal-ldap-vm02-prod"
      ~ private_ip_address                                     = "10.24.246.39" -> (known after apply)
      ~ private_ip_addresses                                   = [
          - "10.24.246.39",
        ] -> (known after apply)
      + public_ip_address                                      = (known after apply)
      ~ public_ip_addresses                                    = [] -> (known after apply)
      - secure_boot_enabled                                    = false -> null
        tags                                                   = {
            "application"  = "crime-portal"
            "builtFrom"    = "hmcts/crime-portal-infra"
            "businessArea" = "cross-cutting"
            "criticality"  = "High"
            "environment"  = "production"
        }
      ~ virtual_machine_id                                     = "cd9e69f3-2211-4ce4-9850-fceb9bf8afe8" -> (known after apply)
      - vtpm_enabled                                           = false -> null
        # (16 unchanged attributes hidden)

      ~ identity {
          - identity_ids = [] -> null
          ~ principal_id = "b7b3d4f7-5da0-4656-a6a5-4f3b5347a442" -> (known after apply)
          ~ tenant_id    = "531ff96d-0ae9-462a-8d2d-bec7c0b42082" -> (known after apply)
            # (1 unchanged attribute hidden)
        }

      ~ os_disk {
          ~ disk_size_gb              = 30 -> 128
          ~ name                      = "crime-portal-ldap-vm02-prod_OsDisk_1_06dcf012db504780bd0bc790029674ea" -> (known after apply)
            # (3 unchanged attributes hidden)
        }

        # (2 unchanged blocks hidden)
    }

  # module.virtual-machines["crime-portal-frontend-vm01-prod"].module.vm-bootstrap[0].azurerm_virtual_machine_extension.azure_monitor[0] must be replaced
-/+ resource "azurerm_virtual_machine_extension" "azure_monitor" {
      - automatic_upgrade_enabled   = false -> null
      ~ id                          = "/subscriptions/17390ec1-5a5e-4a20-afb3-38d8d726ae45/resourceGroups/crime-portal-rg-prod/providers/Microsoft.Compute/virtualMachines/crime-portal-frontend-vm01-prod/extensions/AMALinux" -> (known after apply)
        name                        = "AMALinux"
        tags                        = {
            "application"  = "crime-portal"
            "builtFrom"    = "hmcts/crime-portal-infra"
            "businessArea" = "cross-cutting"
            "criticality"  = "High"
            "environment"  = "production"
        }
      ~ virtual_machine_id          = "/subscriptions/17390ec1-5a5e-4a20-afb3-38d8d726ae45/resourceGroups/crime-portal-rg-prod/providers/Microsoft.Compute/virtualMachines/crime-portal-frontend-vm01-prod" # forces replacement -> (known after apply) # forces replacement
        # (5 unchanged attributes hidden)
    }

  # module.virtual-machines["crime-portal-frontend-vm01-prod"].module.vm-bootstrap[0].azurerm_virtual_machine_extension.custom_script[0] must be replaced
-/+ resource "azurerm_virtual_machine_extension" "custom_script" {
      - automatic_upgrade_enabled   = false -> null
      ~ id                          = "/subscriptions/17390ec1-5a5e-4a20-afb3-38d8d726ae45/resourceGroups/crime-portal-rg-prod/providers/Microsoft.Compute/virtualMachines/crime-portal-frontend-vm01-prod/extensions/HMCTSVMBootstrap" -> (known after apply)
        name                        = "HMCTSVMBootstrap"
        tags                        = {
            "application"  = "crime-portal"
            "builtFrom"    = "hmcts/crime-portal-infra"
            "businessArea" = "cross-cutting"
            "criticality"  = "High"
            "environment"  = "production"
        }
      ~ virtual_machine_id          = "/subscriptions/17390ec1-5a5e-4a20-afb3-38d8d726ae45/resourceGroups/crime-portal-rg-prod/providers/Microsoft.Compute/virtualMachines/crime-portal-frontend-vm01-prod" # forces replacement -> (known after apply) # forces replacement
        # (6 unchanged attributes hidden)
    }

  # module.virtual-machines["crime-portal-frontend-vm01-prod"].module.vm-bootstrap[0].azurerm_virtual_machine_extension.dynatrace_oneagent[0] must be replaced
-/+ resource "azurerm_virtual_machine_extension" "dynatrace_oneagent" {
      - automatic_upgrade_enabled   = false -> null
      ~ id                          = "/subscriptions/17390ec1-5a5e-4a20-afb3-38d8d726ae45/resourceGroups/crime-portal-rg-prod/providers/Microsoft.Compute/virtualMachines/crime-portal-frontend-vm01-prod/extensions/Dynatrace" -> (known after apply)
        name                        = "Dynatrace"
      ~ settings                    = (sensitive value)
        tags                        = {
            "application"  = "crime-portal"
            "builtFrom"    = "hmcts/crime-portal-infra"
            "businessArea" = "cross-cutting"
            "criticality"  = "High"
            "environment"  = "production"
        }
      ~ virtual_machine_id          = "/subscriptions/17390ec1-5a5e-4a20-afb3-38d8d726ae45/resourceGroups/crime-portal-rg-prod/providers/Microsoft.Compute/virtualMachines/crime-portal-frontend-vm01-prod" # forces replacement -> (known after apply) # forces replacement
        # (5 unchanged attributes hidden)
    }

  # module.virtual-machines["crime-portal-frontend-vm02-prod"].module.vm-bootstrap[0].azurerm_virtual_machine_extension.azure_monitor[0] must be replaced
-/+ resource "azurerm_virtual_machine_extension" "azure_monitor" {
      - automatic_upgrade_enabled   = false -> null
      ~ id                          = "/subscriptions/17390ec1-5a5e-4a20-afb3-38d8d726ae45/resourceGroups/crime-portal-rg-prod/providers/Microsoft.Compute/virtualMachines/crime-portal-frontend-vm02-prod/extensions/AMALinux" -> (known after apply)
        name                        = "AMALinux"
        tags                        = {
            "application"  = "crime-portal"
            "builtFrom"    = "hmcts/crime-portal-infra"
            "businessArea" = "cross-cutting"
            "criticality"  = "High"
            "environment"  = "production"
        }
      ~ virtual_machine_id          = "/subscriptions/17390ec1-5a5e-4a20-afb3-38d8d726ae45/resourceGroups/crime-portal-rg-prod/providers/Microsoft.Compute/virtualMachines/crime-portal-frontend-vm02-prod" # forces replacement -> (known after apply) # forces replacement
        # (5 unchanged attributes hidden)
    }

  # module.virtual-machines["crime-portal-frontend-vm02-prod"].module.vm-bootstrap[0].azurerm_virtual_machine_extension.custom_script[0] must be replaced
-/+ resource "azurerm_virtual_machine_extension" "custom_script" {
      - automatic_upgrade_enabled   = false -> null
      ~ id                          = "/subscriptions/17390ec1-5a5e-4a20-afb3-38d8d726ae45/resourceGroups/crime-portal-rg-prod/providers/Microsoft.Compute/virtualMachines/crime-portal-frontend-vm02-prod/extensions/HMCTSVMBootstrap" -> (known after apply)
        name                        = "HMCTSVMBootstrap"
        tags                        = {
            "application"  = "crime-portal"
            "builtFrom"    = "hmcts/crime-portal-infra"
            "businessArea" = "cross-cutting"
            "criticality"  = "High"
            "environment"  = "production"
        }
      ~ virtual_machine_id          = "/subscriptions/17390ec1-5a5e-4a20-afb3-38d8d726ae45/resourceGroups/crime-portal-rg-prod/providers/Microsoft.Compute/virtualMachines/crime-portal-frontend-vm02-prod" # forces replacement -> (known after apply) # forces replacement
        # (6 unchanged attributes hidden)
    }

  # module.virtual-machines["crime-portal-frontend-vm02-prod"].module.vm-bootstrap[0].azurerm_virtual_machine_extension.dynatrace_oneagent[0] must be replaced
-/+ resource "azurerm_virtual_machine_extension" "dynatrace_oneagent" {
      - automatic_upgrade_enabled   = false -> null
      ~ id                          = "/subscriptions/17390ec1-5a5e-4a20-afb3-38d8d726ae45/resourceGroups/crime-portal-rg-prod/providers/Microsoft.Compute/virtualMachines/crime-portal-frontend-vm02-prod/extensions/Dynatrace" -> (known after apply)
        name                        = "Dynatrace"
      ~ settings                    = (sensitive value)
        tags                        = {
            "application"  = "crime-portal"
            "builtFrom"    = "hmcts/crime-portal-infra"
            "businessArea" = "cross-cutting"
            "criticality"  = "High"
            "environment"  = "production"
        }
      ~ virtual_machine_id          = "/subscriptions/17390ec1-5a5e-4a20-afb3-38d8d726ae45/resourceGroups/crime-portal-rg-prod/providers/Microsoft.Compute/virtualMachines/crime-portal-frontend-vm02-prod" # forces replacement -> (known after apply) # forces replacement
        # (5 unchanged attributes hidden)
    }

  # module.virtual-machines["crime-portal-ldap-vm01-prod"].module.vm-bootstrap[0].azurerm_virtual_machine_extension.azure_monitor[0] must be replaced
-/+ resource "azurerm_virtual_machine_extension" "azure_monitor" {
      - automatic_upgrade_enabled   = false -> null
      ~ id                          = "/subscriptions/17390ec1-5a5e-4a20-afb3-38d8d726ae45/resourceGroups/crime-portal-rg-prod/providers/Microsoft.Compute/virtualMachines/crime-portal-ldap-vm01-prod/extensions/AMALinux" -> (known after apply)
        name                        = "AMALinux"
        tags                        = {
            "application"  = "crime-portal"
            "builtFrom"    = "hmcts/crime-portal-infra"
            "businessArea" = "cross-cutting"
            "criticality"  = "High"
            "environment"  = "production"
        }
      ~ virtual_machine_id          = "/subscriptions/17390ec1-5a5e-4a20-afb3-38d8d726ae45/resourceGroups/crime-portal-rg-prod/providers/Microsoft.Compute/virtualMachines/crime-portal-ldap-vm01-prod" # forces replacement -> (known after apply) # forces replacement
        # (5 unchanged attributes hidden)
    }

  # module.virtual-machines["crime-portal-ldap-vm01-prod"].module.vm-bootstrap[0].azurerm_virtual_machine_extension.custom_script[0] must be replaced
-/+ resource "azurerm_virtual_machine_extension" "custom_script" {
      - automatic_upgrade_enabled   = false -> null
      ~ id                          = "/subscriptions/17390ec1-5a5e-4a20-afb3-38d8d726ae45/resourceGroups/crime-portal-rg-prod/providers/Microsoft.Compute/virtualMachines/crime-portal-ldap-vm01-prod/extensions/HMCTSVMBootstrap" -> (known after apply)
        name                        = "HMCTSVMBootstrap"
        tags                        = {
            "application"  = "crime-portal"
            "builtFrom"    = "hmcts/crime-portal-infra"
            "businessArea" = "cross-cutting"
            "criticality"  = "High"
            "environment"  = "production"
        }
      ~ virtual_machine_id          = "/subscriptions/17390ec1-5a5e-4a20-afb3-38d8d726ae45/resourceGroups/crime-portal-rg-prod/providers/Microsoft.Compute/virtualMachines/crime-portal-ldap-vm01-prod" # forces replacement -> (known after apply) # forces replacement
        # (6 unchanged attributes hidden)
    }

  # module.virtual-machines["crime-portal-ldap-vm01-prod"].module.vm-bootstrap[0].azurerm_virtual_machine_extension.dynatrace_oneagent[0] must be replaced
-/+ resource "azurerm_virtual_machine_extension" "dynatrace_oneagent" {
      - automatic_upgrade_enabled   = false -> null
      ~ id                          = "/subscriptions/17390ec1-5a5e-4a20-afb3-38d8d726ae45/resourceGroups/crime-portal-rg-prod/providers/Microsoft.Compute/virtualMachines/crime-portal-ldap-vm01-prod/extensions/Dynatrace" -> (known after apply)
        name                        = "Dynatrace"
      ~ settings                    = (sensitive value)
        tags                        = {
            "application"  = "crime-portal"
            "builtFrom"    = "hmcts/crime-portal-infra"
            "businessArea" = "cross-cutting"
            "criticality"  = "High"
            "environment"  = "production"
        }
      ~ virtual_machine_id          = "/subscriptions/17390ec1-5a5e-4a20-afb3-38d8d726ae45/resourceGroups/crime-portal-rg-prod/providers/Microsoft.Compute/virtualMachines/crime-portal-ldap-vm01-prod" # forces replacement -> (known after apply) # forces replacement
        # (5 unchanged attributes hidden)
    }

  # module.virtual-machines["crime-portal-ldap-vm02-prod"].module.vm-bootstrap[0].azurerm_virtual_machine_extension.azure_monitor[0] must be replaced
-/+ resource "azurerm_virtual_machine_extension" "azure_monitor" {
      - automatic_upgrade_enabled   = false -> null
      ~ id                          = "/subscriptions/17390ec1-5a5e-4a20-afb3-38d8d726ae45/resourceGroups/crime-portal-rg-prod/providers/Microsoft.Compute/virtualMachines/crime-portal-ldap-vm02-prod/extensions/AMALinux" -> (known after apply)
        name                        = "AMALinux"
        tags                        = {
            "application"  = "crime-portal"
            "builtFrom"    = "hmcts/crime-portal-infra"
            "businessArea" = "cross-cutting"
            "criticality"  = "High"
            "environment"  = "production"
        }
      ~ virtual_machine_id          = "/subscriptions/17390ec1-5a5e-4a20-afb3-38d8d726ae45/resourceGroups/crime-portal-rg-prod/providers/Microsoft.Compute/virtualMachines/crime-portal-ldap-vm02-prod" # forces replacement -> (known after apply) # forces replacement
        # (5 unchanged attributes hidden)
    }

  # module.virtual-machines["crime-portal-ldap-vm02-prod"].module.vm-bootstrap[0].azurerm_virtual_machine_extension.custom_script[0] must be replaced
-/+ resource "azurerm_virtual_machine_extension" "custom_script" {
      - automatic_upgrade_enabled   = false -> null
      ~ id                          = "/subscriptions/17390ec1-5a5e-4a20-afb3-38d8d726ae45/resourceGroups/crime-portal-rg-prod/providers/Microsoft.Compute/virtualMachines/crime-portal-ldap-vm02-prod/extensions/HMCTSVMBootstrap" -> (known after apply)
        name                        = "HMCTSVMBootstrap"
        tags                        = {
            "application"  = "crime-portal"
            "builtFrom"    = "hmcts/crime-portal-infra"
            "businessArea" = "cross-cutting"
            "criticality"  = "High"
            "environment"  = "production"
        }
      ~ virtual_machine_id          = "/subscriptions/17390ec1-5a5e-4a20-afb3-38d8d726ae45/resourceGroups/crime-portal-rg-prod/providers/Microsoft.Compute/virtualMachines/crime-portal-ldap-vm02-prod" # forces replacement -> (known after apply) # forces replacement
        # (6 unchanged attributes hidden)
    }

  # module.virtual-machines["crime-portal-ldap-vm02-prod"].module.vm-bootstrap[0].azurerm_virtual_machine_extension.dynatrace_oneagent[0] must be replaced
-/+ resource "azurerm_virtual_machine_extension" "dynatrace_oneagent" {
      - automatic_upgrade_enabled   = false -> null
      ~ id                          = "/subscriptions/17390ec1-5a5e-4a20-afb3-38d8d726ae45/resourceGroups/crime-portal-rg-prod/providers/Microsoft.Compute/virtualMachines/crime-portal-ldap-vm02-prod/extensions/Dynatrace" -> (known after apply)
        name                        = "Dynatrace"
      ~ settings                    = (sensitive value)
        tags                        = {
            "application"  = "crime-portal"
            "builtFrom"    = "hmcts/crime-portal-infra"
            "businessArea" = "cross-cutting"
            "criticality"  = "High"
            "environment"  = "production"
        }
      ~ virtual_machine_id          = "/subscriptions/17390ec1-5a5e-4a20-afb3-38d8d726ae45/resourceGroups/crime-portal-rg-prod/providers/Microsoft.Compute/virtualMachines/crime-portal-ldap-vm02-prod" # forces replacement -> (known after apply) # forces replacement
        # (5 unchanged attributes hidden)
    }

Plan: 26 to add, 4 to change, 26 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":23,"Program":"tfcmt","SHA1":"","Target":"prod_vm","Vars":{}} -->